# Python Basics
- Numerical
- Text/String
- Date & Time
- List/Array/Dictionary

## Numerical

In [3]:
# Create variables x and y and assign values to it
x = 10
y = 555

In [4]:
print(x)

10

In [5]:
print(y)

555

In [6]:
# Divide y/x 

print(y/x)

# Mul, Divide, Mean, Sum, Subtract, Power

55.5

# String Data

In [1]:
# Creating a string
my_company = 'Tata Power'

In [2]:
print(my_company)

Tata Power

In [3]:
# Accessing individual characters of a string
my_company[5]

'P'

In [5]:
# Slicing a string
my_company[0:4] # additional one for the end value

'Tata'

In [7]:
# Slicing a string
my_company[5:] # till the end

'Power'

In [8]:
# Concatenate 2 Strings
my_company[0] + my_company[7]

'Tw'

# Lists/Arrays

In [9]:
# Creating 2 lists
student = ['Raju', 'Ramesh', 'Priya', 'Anita']
age = [15, 17, 18, 16]

In [10]:
print(student)
print(age)

['Raju', 'Ramesh', 'Priya', 'Anita']
[15, 17, 18, 16]

In [11]:
# Accessing individual item in a list
student[3]

'Anita'

# Dictionary (key : value/list)

In [12]:
{ 'Name' : student, 
 'Age' : age
}

{'Name': ['Raju', 'Ramesh', 'Priya', 'Anita'], 'Age': [15, 17, 18, 16]}

# Pandas Dataframe

In [17]:
import numpy as np
import pandas as pd

In [18]:
df = pd.DataFrame({ 'Name' : student, 
 'Age' : age
})

In [19]:
df

     Name  Age
0    Raju   15
1  Ramesh   17
2   Priya   18
3   Anita   16

In [20]:
# Access Column
df['Name']

0      Raju
1    Ramesh
2     Priya
3     Anita
Name: Name, dtype: object

In [22]:
# Access Row
df.iloc[2]

Name    Priya
Age        18
Name: 2, dtype: object

# Creating Columns

In [23]:
df

     Name  Age
0    Raju   15
1  Ramesh   17
2   Priya   18
3   Anita   16

In [24]:
# Third Column - that has marks for on subject - Maths
df['Maths'] = [20,50,80,70]

In [25]:
df

     Name  Age  Maths
0    Raju   15     20
1  Ramesh   17     50
2   Priya   18     80
3   Anita   16     70

In [26]:
# Fourth Column - Science
df['Science'] = [35,45,23,87]
df

     Name  Age  Maths  Science
0    Raju   15     20       35
1  Ramesh   17     50       45
2   Priya   18     80       23
3   Anita   16     70       87

# Calculated Fields - Add 2 Columns? (Feature Engineering)

In [28]:
# Get a Total Column
df['Total'] = df['Maths'] + df['Science']
df

     Name  Age  Maths  Science  Total
0    Raju   15     20       35     55
1  Ramesh   17     50       45     95
2   Priya   18     80       23    103
3   Anita   16     70       87    157

In [29]:
# Percentage out of 200?
df['Total_Perc'] = df['Total']/200
df

     Name  Age  Maths  Science  Total  Total_Perc
0    Raju   15     20       35     55       0.275
1  Ramesh   17     50       45     95       0.475
2   Priya   18     80       23    103       0.515
3   Anita   16     70       87    157       0.785

# Export data

In [32]:
df.to_csv('student.csv')

In [33]:
df.to_csv('output/student.csv')